Update cornerstone_framework_flow.md
